vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFR32BG1P_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>EFR32BG1P_DFP</name>
  <description>Silicon Labs EFR32 Blue Gecko Series Device Support</description>

  <releases>
    <release version="1.1.0" date="2018-01-02">
      Initial Release of EFR32BG1 Device Family Pack.
      Device support files V5.1.3.
      Flash Algorithms V5.2.0.
      SVD files V5.2.1.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFR32BG1</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFR32BG1 Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="40000000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/DUI0552A_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <book name="Documents/EFR32xG1-ReferenceManual.pdf" title="EFR32xG1 Wireless Gecko Reference Manual"/>
      <book name="Documents/efr32bg1-datasheet.pdf"       title="EFR32BG1 Blue Gecko Data Sheet"/>

      <description>
The Blue Gecko family of wireless solutions.
      </description>

      <!-- ************************  Subfamily 'EFR32BG1P333'  **************************** -->
      <subFamily DsubFamily="EFR32BG1P333">

        <!-- *************************  Device 'EFR32BG1P333F256GM48'  ***************************** -->
        <device Dname="EFR32BG1P333F256GM48">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P333F256GM48"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P333F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFR32BG1P332'  **************************** -->
      <subFamily DsubFamily="EFR32BG1P332">

        <!-- *************************  Device 'EFR32BG1P332F256GM48'  ***************************** -->
        <device Dname="EFR32BG1P332F256GM48">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P332F256GM48"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P332F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1P332F256GM32'  ***************************** -->
        <device Dname="EFR32BG1P332F256GM32">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P332F256GM32"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P332F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1P332F256GJ43'  ***************************** -->
        <device Dname="EFR32BG1P332F256GJ43">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P332F256GJ43"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P332F256GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFR32BG1P233'  **************************** -->
      <subFamily DsubFamily="EFR32BG1P233">

        <!-- *************************  Device 'EFR32BG1P233F256GM48'  ***************************** -->
        <device Dname="EFR32BG1P233F256GM48">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P233F256GM48"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P233F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFR32BG1P232'  **************************** -->
      <subFamily DsubFamily="EFR32BG1P232">

        <!-- *************************  Device 'EFR32BG1P232F256GM48'  ***************************** -->
        <device Dname="EFR32BG1P232F256GM48">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P232F256GM48"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P232F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1P232F256GM32'  ***************************** -->
        <device Dname="EFR32BG1P232F256GM32">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P232F256GM32"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P232F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1P232F256GJ43'  ***************************** -->
        <device Dname="EFR32BG1P232F256GJ43">
          <compile header="Device/EFR32BG1P/Include/em_device.h"  define="EFR32BG1P232F256GJ43"/>
          <debug svd="SVD/EFR32BG1P/EFR32BG1P232F256GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>


      <!-- ************************  Subfamily 'EFR32BG1B232'  **************************** -->
      <subFamily DsubFamily="EFR32BG1B232">

