vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFR32BG1P_DFP.pdsc
        <!-- *************************  Device 'EFR32BG1B232F256GM56'  ***************************** -->
        <device Dname="EFR32BG1B232F256GM56">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F256GM56"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F256GM56.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B232F256GM48'  ***************************** -->
        <device Dname="EFR32BG1B232F256GM48">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F256GM48"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B232F256GM32'  ***************************** -->
        <device Dname="EFR32BG1B232F256GM32">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F256GM32"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B232F256IM32'  ***************************** -->
        <device Dname="EFR32BG1B232F256IM32">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F256IM32"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F256IM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B232F256GJ43'  ***************************** -->
        <device Dname="EFR32BG1B232F256GJ43">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F256GJ43"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F256GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B232F128GM48'  ***************************** -->
        <device Dname="EFR32BG1B232F128GM48">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F128GM48"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F128GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B232F128GM32'  ***************************** -->
        <device Dname="EFR32BG1B232F128GM32">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F128GM32"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F128GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B232F128GJ43'  ***************************** -->
        <device Dname="EFR32BG1B232F128GJ43">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B232F128GJ43"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B232F128GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFR32BG1B132'  **************************** -->
      <subFamily DsubFamily="EFR32BG1B132">

        <!-- *************************  Device 'EFR32BG1B132F256GM56'  ***************************** -->
        <device Dname="EFR32BG1B132F256GM56">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F256GM56"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F256GM56.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B132F256GM48'  ***************************** -->
        <device Dname="EFR32BG1B132F256GM48">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F256GM48"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B132F256GM32'  ***************************** -->
        <device Dname="EFR32BG1B132F256GM32">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F256GM32"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B132F256IM32'  ***************************** -->
        <device Dname="EFR32BG1B132F256IM32">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F256IM32"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F256IM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B132F256GJ43'  ***************************** -->
        <device Dname="EFR32BG1B132F256GJ43">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F256GJ43"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F256GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B132F128GM48'  ***************************** -->
        <device Dname="EFR32BG1B132F128GM48">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F128GM48"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F128GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B132F128GM32'  ***************************** -->
        <device Dname="EFR32BG1B132F128GM32">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F128GM32"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F128GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1B132F128GJ43'  ***************************** -->
        <device Dname="EFR32BG1B132F128GJ43">
          <compile header="Device/EFR32BG1B/Include/em_device.h"  define="EFR32BG1B132F128GJ43"/>
          <debug svd="SVD/EFR32BG1B/EFR32BG1B132F128GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00007C00" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>


      <!-- ************************  Subfamily 'EFR32BG1V132'  **************************** -->
      <subFamily DsubFamily="EFR32BG1V132">

        <!-- *************************  Device 'EFR32BG1V132F256GM48'  ***************************** -->
        <device Dname="EFR32BG1V132F256GM48">
          <compile header="Device/EFR32BG1V/Include/em_device.h"  define="EFR32BG1V132F256GM48"/>
          <debug svd="SVD/EFR32BG1V/EFR32BG1V132F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

