vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFR32BG1P_DFP.pdsc
        <!-- *************************  Device 'EFR32BG1V132F256GM32'  ***************************** -->
        <device Dname="EFR32BG1V132F256GM32">
          <compile header="Device/EFR32BG1V/Include/em_device.h"  define="EFR32BG1V132F256GM32"/>
          <debug svd="SVD/EFR32BG1V/EFR32BG1V132F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1V132F256IM32'  ***************************** -->
        <device Dname="EFR32BG1V132F256IM32">
          <compile header="Device/EFR32BG1V/Include/em_device.h"  define="EFR32BG1V132F256IM32"/>
          <debug svd="SVD/EFR32BG1V/EFR32BG1V132F256IM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1V132F256GJ43'  ***************************** -->
        <device Dname="EFR32BG1V132F256GJ43">
          <compile header="Device/EFR32BG1V/Include/em_device.h"  define="EFR32BG1V132F256GJ43"/>
          <debug svd="SVD/EFR32BG1V/EFR32BG1V132F256GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00040000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1V132F128GM48'  ***************************** -->
        <device Dname="EFR32BG1V132F128GM48">
          <compile header="Device/EFR32BG1V/Include/em_device.h"  define="EFR32BG1V132F128GM48"/>
          <debug svd="SVD/EFR32BG1V/EFR32BG1V132F128GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1V132F128GM32'  ***************************** -->
        <device Dname="EFR32BG1V132F128GM32">
          <compile header="Device/EFR32BG1V/Include/em_device.h"  define="EFR32BG1V132F128GM32"/>
          <debug svd="SVD/EFR32BG1V/EFR32BG1V132F128GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32BG1V132F128GJ43'  ***************************** -->
        <device Dname="EFR32BG1V132F128GJ43">
          <compile header="Device/EFR32BG1V/Include/em_device.h"  define="EFR32BG1V132F128GJ43"/>
          <debug svd="SVD/EFR32BG1V/EFR32BG1V132F128GJ43.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32BG1P">
      <description>Silicon Labs EFR32BG1P devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32BG1P*"/>
    </condition>
    <condition id="EFR32BG1B">
      <description>Silicon Labs EFR32BG1B devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32BG1B*"/>
    </condition>
    <condition id="EFR32BG1V">
      <description>Silicon Labs EFR32BG1V devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32BG1V*"/>
    </condition>

    <condition id="EFR32BG1">
      <description>Silicon Labs EFR32BG1 devices</description>
      <require Dvendor="Silicon Labs:21"/>
      <accept  Dname="EFR32BG1P*"/>
      <accept  Dname="EFR32BG1B*"/>
      <accept  Dname="EFR32BG1V*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFR32BG1P CMSIS">
      <description>Silicon Labs EFR32BG1P devices, CMSIS Core</description>
      <require condition="EFR32BG1P"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="EFR32BG1B CMSIS">
      <description>Silicon Labs EFR32BG1B devices, CMSIS Core</description>
      <require condition="EFR32BG1B"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="EFR32BG1V CMSIS">
      <description>Silicon Labs EFR32BG1V devices, CMSIS Core</description>
      <require condition="EFR32BG1V"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFR32BG1P CMSIS GCC">
      <description>Silicon Labs EFR32BG1P devices, CMSIS Core, GCC compiler</description>
      <require condition="EFR32BG1P CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="EFR32BG1B CMSIS GCC">
      <description>Silicon Labs EFR32BG1B devices, CMSIS Core, GCC compiler</description>
      <require condition="EFR32BG1B CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="EFR32BG1V CMSIS GCC">
      <description>Silicon Labs EFR32BG1V devices, CMSIS Core, GCC compiler</description>
      <require condition="EFR32BG1V CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFR32BG1"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <!--condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFR32BG1"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition-->
    <condition id="emlib EMU">
      <description>Silicon Labs emlib with EMU</description>
      <require condition="EFR32BG1"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EMU"/>
    </condition>
