vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFR32BG1P_DFP.pdsc
    <condition id="emlib CMU">
      <description>Silicon Labs emlib with CMU</description>
      <require condition="EFR32BG1"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
    </condition>
    <condition id="emlib CMU SYSTEM">
      <description>Silicon Labs emlib with CMU, SYSTEM</description>
      <require condition="EFR32BG1"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib CMU SYSTEM CORE">
      <description>Silicon Labs emlib with CMU, SYSTEM, CORE</description>
      <require condition="EFR32BG1"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CORE"/>
    </condition>
    <condition id="emlib CMU GPIO">
      <description>Silicon Labs emlib with CMU, GPIO</description>
      <require condition="EFR32BG1"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
    </condition>
  </conditions>

  <taxonomy>
    <description Cclass="Device"        Cgroup="emlib"   doc="emdoc/efr32bg1/html/group__emlib.html" >Silicon Labs Low-level peripheral library</description>
  </taxonomy>

  <components>
    <!-- Startup EFR32BG1P -->
    <component Cclass="Device" Cgroup="Startup"                      Cversion="5.1.3" condition="EFR32BG1P CMSIS">
      <description>System Startup for Silicon Labs EFR32BG1P device series</description>
      <files>
        <file category="doc"          name="emdoc/efr32bg1/html/index.html"/>

        <file category="include"      name="Device/EFR32BG1P/Include/"/>
        <file category="sourceAsm"    name="Device/EFR32BG1P/Source/ARM/startup_efr32bg1p.s" attr="config" version="5.1.3" condition="Compiler ARMCC"/>
        <file category="sourceC"      name="Device/EFR32BG1P/Source/GCC/startup_efr32bg1p.S" attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="linkerScript" name="Device/EFR32BG1P/Source/GCC/efr32bg1p.ld"        attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="source"       name="Device/EFR32BG1P/Source/system_efr32bg1p.c"      attr="config" version="5.1.3"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"       name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.0.2"/-->
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="5.1.3" condition="EFR32BG1P CMSIS GCC">
      <description>System Startup for Silicon Labs EFR32BG1P device series</description>
      <files>
        <file category="doc"         name="emdoc/efr32bg1/html/index.html"/>

        <file category="include"      name="Device/EFR32BG1P/Include/"/>
        <file category="sourceC"      name="Device/EFR32BG1P/Source/GCC/startup_efr32bg1p.c" attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="linkerScript" name="Device/EFR32BG1P/Source/GCC/efr32bg1p.ld"        attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="sourceC"      name="Device/EFR32BG1P/Source/system_efr32bg1p.c"      attr="config" version="5.1.3"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"       name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.0.2"/-->
      </files>
    </component>

    <!-- Startup EFR32BG1B -->
    <component Cclass="Device" Cgroup="Startup"                      Cversion="5.1.3" condition="EFR32BG1B CMSIS">
      <description>System Startup for Silicon Labs EFR32BG1B device series</description>
      <files>
        <file category="doc"          name="emdoc/efr32bg1/html/index.html"/>

        <file category="include"      name="Device/EFR32BG1B/Include/"/>
        <file category="sourceAsm"    name="Device/EFR32BG1B/Source/ARM/startup_efr32bg1b.s" attr="config" version="5.1.3" condition="Compiler ARMCC"/>
        <file category="sourceC"      name="Device/EFR32BG1B/Source/GCC/startup_efr32bg1b.S" attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="linkerScript" name="Device/EFR32BG1B/Source/GCC/efr32bg1b.ld"        attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="source"       name="Device/EFR32BG1B/Source/system_efr32bg1b.c"      attr="config" version="5.1.3"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"       name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.0.2"/-->
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="5.1.3" condition="EFR32BG1B CMSIS GCC">
      <description>System Startup for Silicon Labs EFR32BG1B device series</description>
      <files>
        <file category="doc"         name="emdoc/efr32bg1/html/index.html"/>

        <file category="include"      name="Device/EFR32BG1B/Include/"/>
        <file category="sourceC"      name="Device/EFR32BG1B/Source/GCC/startup_efr32bg1b.c" attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="linkerScript" name="Device/EFR32BG1B/Source/GCC/efr32bg1b.ld"        attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="sourceC"      name="Device/EFR32BG1B/Source/system_efr32bg1b.c"      attr="config" version="5.1.3"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"       name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.0.2"/-->
      </files>
    </component>

    <!-- Startup EFR32BG1V -->
    <component Cclass="Device" Cgroup="Startup"                      Cversion="5.1.3" condition="EFR32BG1V CMSIS">
      <description>System Startup for Silicon Labs EFR32BG1V device series</description>
      <files>
        <file category="doc"          name="emdoc/efr32bg1/html/index.html"/>

        <file category="include"      name="Device/EFR32BG1V/Include/"/>
        <file category="sourceAsm"    name="Device/EFR32BG1V/Source/ARM/startup_efr32bg1v.s" attr="config" version="5.1.3" condition="Compiler ARMCC"/>
        <file category="sourceC"      name="Device/EFR32BG1V/Source/GCC/startup_efr32bg1v.S" attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="linkerScript" name="Device/EFR32BG1V/Source/GCC/efr32bg1v.ld"        attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="source"       name="Device/EFR32BG1V/Source/system_efr32bg1v.c"      attr="config" version="5.1.3"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"       name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.0.2"/-->
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="5.1.3" condition="EFR32BG1V CMSIS GCC">
      <description>System Startup for Silicon Labs EFR32BG1V device series</description>
      <files>
        <file category="doc"         name="emdoc/efr32bg1/html/index.html"/>

        <file category="include"      name="Device/EFR32BG1V/Include/"/>
        <file category="sourceC"      name="Device/EFR32BG1V/Source/GCC/startup_efr32bg1v.c" attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="linkerScript" name="Device/EFR32BG1V/Source/GCC/efr32bg1v.ld"        attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="sourceC"      name="Device/EFR32BG1V/Source/system_efr32bg1v.c"      attr="config" version="5.1.3"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"       name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.0.2"/-->
      </files>
    </component>

    <!-- emlib -->
    <component Cclass="Device" Cgroup="emlib" Csub="Framework" Cversion="5.1.3" condition="EFR32BG1">
      <description>emlib Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efr32bg1/html/group__emlib.html"/>
        <file category="header"  name="emlib/inc/em_common.h"/>
        <file category="header"  name="emlib/inc/em_chip.h"/>
        <file category="header"  name="emlib/inc/em_bus.h"/>
        <file category="header"  name="emlib/inc/em_version.h"/>
        <file category="header"  name="emlib/inc/em_assert.h"/>
        <file category="source"  name="emlib/src/em_assert.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="ACMP"      Cversion="5.1.3" condition="emlib Framework">
      <description>Analog comparator (ACMP) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_ACMP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efr32bg1/html/group__ACMP.html"/>
        <file category="header"  name="emlib/inc/em_acmp.h"/>
        <file category="source"  name="emlib/src/em_acmp.c"/>
      </files>
    </component>
